[{
	"name": "About Me",
	"section": "About Me",
	"date": "2016-07-12",
	"navImg": {
		"name": "About Me",
		"url": "person.png"
	},
	"html": "<p class=\"last\">Hello, I am David, and this is my portfolio site.  Hopefully after browsing this site, you can get a sense of who I am and where I am going.  I began making this portfolio as a student at Code Fellows in July 2016.  At Code Fellows, I am studying to become a competitive developer, and plan on working as a data analyst.  I enjoy working with data in general, and find solving problems with it fun and rewarding.</p>"
}, {
	"name": "Education",
	"section": "Education",
	"date": "2016-07-12",
	"navImg": {
		"name": "Education",
		"url": "edu.png"
	},
	"html": "<p class=\"last\">I graduated in 2015 with a B.S. in chemistry and a B.A. in biochemistry from the University of Washington.  My favorite subjects were chemical biology, quantitative analysis, and statistical mechanics.  I joined Code Fellows in the summer of 2016 as a 201 student learning HTML, CSS, and JavaScript, and am currently in the 301 class, on track to learn Python.  If you click on my GitHub link at the top of the page, you can see some of the projects that I have been working on.</p>"
}, {
	"name": "Experience",
	"section": "Experience",
	"date": "2016-07-12",
	"navImg": {
		"name": "Experience",
		"url": "work.png"
	},
	"html": "<p class=\"last\">Throughout my experience as a working member of society, I have worked as a cashier, a QA technician at a tire factory, and a server at many restaurants.  I am in the process of taking what I have learned and changing my career to the technology field, incorporating my education and experiences.</p>"
}, {
	"name": "Interests",
	"section": "Interests",
	"date": "2016-07-12",
	"navImg": {
		"name": "Interests",
		"url": "interests.png"
	},
	"html": "<p class=\"last\">When I'm not coding, I have several hobbies keeping me busy.  I enjoy taking vacations, with my most recent trip being to Iceland.  It was one of the most beautiful places I have ever seen.  I also enjoy brewing beer.  I am currently fermenting a ginger beer for the first time.  For video games, I have been playing Fallout 4 and dying a lot in Dark Souls III.  I am also in one of the most in-depth fantasy football leagues ever made.</p>"
}, {
	"name": "Code",
	"section": "Pam's Salmon Cookies",
	"date": "2016-07-15",
	"navImg": {
		"name": "Code",
		"url": "my_computer.png"
	},
	"html": "<p class=\"last\"><a href=\"https://bl41r.github.io/cookie-stand/\"><img class=\"entry-img\" src=\"img/salmon-cookies.png\"></a>In this project, I took the role of a consultant building a website for a (fictitious) small business which requested we used every image that they supplied us, and come up with an attractive website for their company.  I also implemented a <a href=\"https://bl41r.github.io/cookie-stand/sales.html\">form</a> for the business for the company to display their sales information for the different store locations.  <a href=\"https://github.com/Bl41r/cookie-stand\">Link to GitHub repository</a></p>"
	}, {
		"name": "Code",
		"section": "BusMall Market Research",
		"date": "2016-07-16",
		"html": "<p class=\"last\"><a href=\"https://bl41r.github.io/bus_mall/\"><img class=\"entry-img\" src=\"img/busmall1.png\"><img class=\"entry-img\" src=\"img/busmall2.png\"></a>In this project, my task was to create an application that a company could use to predict the popularity of potential products that they could offer.  The fictitious company, known as \"BusMall\", is a company aimed at selling products to bus riders, similar to how SkyMall is for flyers.  After letting a user select a product from three they would be most likely to purchase, the survey results can be viewed.  The data is stored in localStorage, and accumulates as more results are processed.  I used Chart.js to display the results graph, and used the Google Charts API to display the table of information.   <a href=\"https://github.com/Bl41r/bus_mall\">Link to GitHub repository</a></p>"
		},
	{
		"name": "Code",
		"section": "Marker Fix with Google Maps and Javascript",
		"date": "2016-07-18",
		"html": "<p>This function is one that I created for my Eat Fellows project, which solves the problem of multiple google map markers at the same location.  It takes in an array of google map markers (not all of them must match a single location), and basically finds the markers with the same locations, and arranges them around a square grid, allowing up to 9 locations to be displayed which inhabit the same spot on the map.</p>\n<pre><code>function offsetDuplicates(listOfMarkers) {\n  var d = 0.00015; //Amount lat/lng to offset by\n  var scale = 1.5;  //scale used to adjust difference between lat/long appearanceon 2d map\n  var offsets = [[d / scale, 0],[0, d],[-d / scale, 0],[0, -d],[d / scale, d],[-d / scale, d],[-d / scale, -d],[d / scale, -d]];\n  var rMarkers = [];\n  var newEntry = true;\n  //create 2-d array of matching markerList marker indices\n  for (var i = 0; i &lt; listOfMarkers.length; i++) {\n    var tmp = [];\n    tmp.push(i);\n    for (var j = 0; j &lt; listOfMarkers.length; j++) {\n      if (listOfMarkers[i].getPosition().toString() === listOfMarkers[j].getPosition().toString() &amp;&amp; i != j) {\n        tmp.push(j);\n      }\n    }\n    tmp = tmp.sort();\n    rMarkers.push(tmp);\n  }\n  //remove unique marker arrays\n  for (var k = 0; k &lt; rMarkers.length; k++) {\n    if (rMarkers[k].length === 1) {\n      rMarkers.splice(k, 1);\n      k--;\n    }\n  }\n  //remove duplicates of match arrays\n  for (var l = 0; l &lt; rMarkers.length; l++) {\n    for (var m = 0; m &lt; rMarkers.length; m++) {\n      if (JSON.stringify(rMarkers[l]) === JSON.stringify(rMarkers[m]) &amp;&amp; l != m) {\n        rMarkers.splice(m, 1);\n        m--;\n      }\n    }\n  }\n\n// apply loc offsets to markers with same location\n  var x, y;\n  for (var k = 0; k &lt; rMarkers.length; k++){\n    for (var l = 1; l &lt; rMarkers[k].length; l++) {\n      x = listOfMarkers[rMarkers[k][l]].getPosition().lat();\n      y = listOfMarkers[rMarkers[k][l]].getPosition().lng();\n      x += offsets[l][0];\n      y += offsets[l][1];\n      var point = new google.maps.LatLng(x,y);\n      listOfMarkers[rMarkers[k][l]].setPosition(point);\n    }\n  }\n  return listOfMarkers;\n}\n</code></pre><p class=\"last\">As you can see, there are many nested loops which can be refactored in the future.  This was part of one of the first projects I had while learning JavaScript.\n<a href=\"https://github.com/Bl41r/eat_fellows/blob/master/js/markerfix.js\">Link to GitHub repository</a></p>"
	},
	{
		"name": "Code",
		"section": "Eat Fellows",
		"date": "2016-07-17",
		"html": "<p class=\"last\"><a href=\"https://bl41r.github.io/eat_fellows/\"><img class=\"entry-img\" src=\"img/eat_fellows_shot.png\"></a>This was my end-of-the-class project for my first class at Code Fellows.  With 3 other classmates, we put together a web site to help new students (such as ourselves) find a place to eat nearby for lunch.  Using a model similar to Yelp, we used a survey to create a local database of restaurants that other students enjoyed, and added a google map with markers and the ability to filter results by food category, price, and whether or not it was a good place to code.  The site makes the ordeal as simple as possible.  There is also a form for adding new restaurants, as well as the ability to leave reviews.  We managed to pull this project off in just under a week, and am very proud of it, considering that I had only been studying JavaScript, HTML, and CSS for three weeks before starting it.\n<a href=\"https://github.com/Bl41r/eat_fellows\">Link to GitHub repository</a></p>"
	}
]
